[M_Nast_Easter_Side01:DefeatSparkySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sparky Flint, Captain Flint's beloved son, is coming. He and the rest of his followers (victims of the Warehouse Hunters) plan to get revenge on all of you..<br><br>Unfortunately, other members of VOVH Sparky passed away under various mysterious circumstances. But Sparky's anger cannot be contained. He asked her to find him to kill her himself..<br><br>You have it! kill him now."

[M_Nast_Easter_Side01:FindSparkySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="We will capture the beloved Sparky Flint, son of Captain Flint, because he and the other members of his support group (Treasure Group) want revenge against you. ..<br><br>Unfortunately some members of Sparky's VOVH have died in various and mysterious circumstances. But Spark's rage was uncontrollable; They asked you to meet and physically beat you."

[M_Nast_Easter_Side01:FollowVarkid MissionObjectiveDefinition]
ProgressMessage="Follow the work"

[M_Nast_Easter_Side01:InjectEggSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Dear Sparky Flint, son of Captain Flint, I'm calling. He and the rest of his support group (Vault Hunters Vault) want revenge on you..<br><br>Unfortunately, Sparky is lost among the other VOVH members and needs to be found. And they can kill you. He was very shy..<br><br>First you need to follow Bloodhound Varkid to the first assassin.."

[M_Nast_Easter_Side01:IntroRevengeSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sparky Flint, the son of the late Captain Flint, has contacted him and his friends (the victims of the Vault Hunter) seeking revenge on all of you.."

[M_Nast_Easter_Side01:ReturnToHammerlockSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sparky Flint, son of the late, dear Captain Flint, has caught you. He and his entire group (all hunters) plan to take revenge on you all..<br><br>However, all the assassins die by accident and Sparky Flint falls out of your hand. Sir Hammerlock wants you to return to him - he knows why all your assassins died without him lifting a finger.."

[M_Nast_Easter_Side01:SearchForAssassinsSet0 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sparky Flint, the son of the late Captain Flint, has contacted him and his friends (the victims of the Vault Hunter) seeking revenge on all of you..<br><br>Unfortunately, Sparky has lost track of the other VOVH members and, er, needs you to find them. So they can kill you. He's very embarrassed about it."
